In [33]:
# Install the library 
!pip install jovian --upgrade --quiet
!pip install pandas
import pandas as pd
import jovian

Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.20.1)
Requirement already satisfied: pytz>=2017.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
project_name='covid italy'

In [34]:
covid_df=pd.read_csv('italy_covid.csv')
covid_df

           date  new_cases  new_deaths  new_tests
0    31/12/2019          0           0        NaN
1    01/01/2020          0           0        NaN
2    02/01/2020          0           0        NaN
3    03/01/2020          0           0        NaN
4    04/01/2020          0           0        NaN
..          ...        ...         ...        ...
243  30/08/2020       1444           1    53541.0
244  31/08/2020       1365           4    42583.0
245  01/09/2020        996           6    54395.0
246  02/09/2020        975           8        NaN
247  03/09/2020       1326           6        NaN

[248 rows x 4 columns]

In [26]:
type(covid_df)

pandas.core.frame.DataFrame

In [28]:
covid_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 248 entries, 0 to 247
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        248 non-null    object
 1   new_cases   248 non-null    int64
 2   new_deaths  248 non-null    int64
 3   new_tests   135 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 7.9+ KB

In [29]:
covid_df.describe()

         new_cases  new_deaths     new_tests
count   248.000000  248.000000    135.000000
mean   1094.818548  143.133065  31699.674074
std    1554.508002  227.105538  11622.209757
min    -148.000000  -31.000000   7841.000000
25%     123.000000    3.000000  25259.000000
50%     342.000000   17.000000  29545.000000
75%    1371.750000  175.250000  37711.000000
max    6557.000000  971.000000  95273.000000

In [30]:
covid_df.shape

(248, 4)

In [36]:
jovian.commit(project_name='covid italy',environment=None)

[jovian] Updating notebook "mariamburai030/numpy-array-operations" on https://jovian.ai/
[jovian] Committed successfully! https://jovian.ai/mariamburai030/numpy-array-operations

'https://jovian.ai/mariamburai030/numpy-array-operations'

In [41]:
# Pandas format is not similar to this
covid_data_list = [
    {'date': '2020-08-30', 'new_cases': 1444, 'new_deaths': 1, 'new_tests': 53541},
    {'date': '2020-08-31', 'new_cases': 1365, 'new_deaths': 4, 'new_tests': 42583},
    {'date': '2020-09-01', 'new_cases': 996, 'new_deaths': 6, 'new_tests': 54395},
    {'date': '2020-09-02', 'new_cases': 975, 'new_deaths': 8 },
    {'date': '2020-09-03', 'new_cases': 1326, 'new_deaths': 6},
]

In [42]:
covid_data_dict['new_cases']

[1444, 1365, 996, 975, 1326]

In [39]:
covid_df['new_cases']

0         0
1         0
2         0
3         0
4         0
       ...
243    1444
244    1365
245     996
246     975
247    1326
Name: new_cases, Length: 248, dtype: int64

In [40]:
type(covid_df['new_cases'])

pandas.core.series.Series

In [44]:
# a specific value with a series using the indexing notation `[]`.
covid_df['new_cases'][200]

231

In [45]:
covid_df['new_tests'][240]

57640.0

In [46]:
#Pandas also provides the `.at` method to retrieve the element at a specific row & column directly.
covid_df.at[246, 'new_cases']

975

In [47]:
covid_df.at[240, 'new_tests']

57640.0

In [48]:
#instead of using the indexing notation [], 
#Pandas also allows accessing columns as properties of the dataframe using the . 
#notation. However, this method only works for columns whose names do not contain spaces or special characters

In [49]:
covid_df.new_cases

0         0
1         0
2         0
3         0
4         0
       ...
243    1444
244    1365
245     996
246     975
247    1326
Name: new_cases, Length: 248, dtype: int64

In [50]:
#Further, you can also pass a list of columns within the indexing notation `[]` 
#to access a subset of the data frame with just the given columns.
cases_df = covid_df[['date', 'new_cases']]
cases_df

           date  new_cases
0    31/12/2019          0
1    01/01/2020          0
2    02/01/2020          0
3    03/01/2020          0
4    04/01/2020          0
..          ...        ...
243  30/08/2020       1444
244  31/08/2020       1365
245  01/09/2020        996
246  02/09/2020        975
247  03/09/2020       1326

[248 rows x 2 columns]

In [ ]:
#The new data frame cases_df is simply a "view" of the original data frame covid_df. 
#Both point to the same data in the computer's memory. 
#Changing any values inside one of them will also change the respective values in the other. 
#Sharing data between data frames makes data manipulation in Pandas blazing fast. 
#You needn't worry about the overhead of copying thousands or millions of rows every time you want to create a new data frame by operating on an existing one.
#Sometimes you might need a full copy of the data frame, in which case you can use the copy method.

In [51]:
covid_df_copy = covid_df.copy()
covid_df_copy

           date  new_cases  new_deaths  new_tests
0    31/12/2019          0           0        NaN
1    01/01/2020          0           0        NaN
2    02/01/2020          0           0        NaN
3    03/01/2020          0           0        NaN
4    04/01/2020          0           0        NaN
..          ...        ...         ...        ...
243  30/08/2020       1444           1    53541.0
244  31/08/2020       1365           4    42583.0
245  01/09/2020        996           6    54395.0
246  02/09/2020        975           8        NaN
247  03/09/2020       1326           6        NaN

[248 rows x 4 columns]

In [52]:
covid_df.loc[243]         #To access a specific row of data, Pandas provides the .loc method.

date          30/08/2020
new_cases           1444
new_deaths             1
new_tests        53541.0
Name: 243, dtype: object

In [53]:
type(covid_df.loc[243])

pandas.core.series.Series

In [54]:
#We can use the .head and .tail methods to view the first or last few rows of data.
covid_df.head(5)

         date  new_cases  new_deaths  new_tests
0  31/12/2019          0           0        NaN
1  01/01/2020          0           0        NaN
2  02/01/2020          0           0        NaN
3  03/01/2020          0           0        NaN
4  04/01/2020          0           0        NaN

In [55]:
covid_df.tail(5)

           date  new_cases  new_deaths  new_tests
243  30/08/2020       1444           1    53541.0
244  31/08/2020       1365           4    42583.0
245  01/09/2020        996           6    54395.0
246  02/09/2020        975           8        NaN
247  03/09/2020       1326           6        NaN

In [56]:
covid_df.at[0, 'new_tests']

nan

In [57]:
covid_df.loc[108:113]

           date  new_cases  new_deaths  new_tests
108  17/04/2020       3786         525        NaN
109  18/04/2020       3493         575        NaN
110  19/04/2020       3491         480        NaN
111  20/04/2020       3047         433     7841.0
112  21/04/2020       2256         454    28095.0
113  22/04/2020       2729         534    44248.0

In [58]:
#We can use the `.sample` method to retrieve a random sample of rows from the data frame.
covid_df.sample(10)

           date  new_cases  new_deaths  new_tests
47   16/02/2020          0           0        NaN
171  19/06/2020        331          66    28570.0
156  04/06/2020        321          71    27451.0
142  21/05/2020        665         161    40644.0
13   13/01/2020          0           0        NaN
160  08/06/2020        197          53    16301.0
198  16/07/2020        162          13    28089.0
227  14/08/2020        522           6    24868.0
37   06/02/2020          0           0        NaN
109  18/04/2020       3493         575        NaN

In [60]:
#Finding the first non-empty index in a series
covid_df.new_tests.first_valid_index()

111

In [61]:
jovian.commit(project_name='covid italy',environment=None)

[jovian] Updating notebook "mariamburai030/numpy-array-operations" on https://jovian.ai/
[jovian] Committed successfully! https://jovian.ai/mariamburai030/numpy-array-operations

'https://jovian.ai/mariamburai030/numpy-array-operations'